; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	infrared1 - mode
	spectrograph4 - mode
	image2 - mode
	spectrograph3 - mode
	thermograph5 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star0 - direction
	Planet5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 thermograph5)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star1)
	(supports instrument4 thermograph5)
	(calibration_target instrument4 GroundStation3)
	(supports instrument5 thermograph0)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 GroundStation4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
	(supports instrument6 spectrograph3)
	(supports instrument6 thermograph5)
	(calibration_target instrument6 Star0)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
	(supports instrument7 thermograph5)
	(supports instrument7 infrared1)
	(supports instrument7 spectrograph3)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star8)
)
(:goal (and
	(pointing satellite3 Phenomenon10)
	(have_image Planet5 thermograph5)
	(have_image Star6 infrared1)
	(have_image Star6 image2)
	(have_image Planet7 spectrograph4)
	(have_image Planet7 thermograph5)
	(have_image Star8 infrared1)
	(have_image Phenomenon9 thermograph5)
	(have_image Phenomenon9 thermograph0)
	(have_image Phenomenon10 thermograph5)
	(have_image Phenomenon10 spectrograph3)
))

)

; plan
1. (turn_to satellite5 star0 star8)
   deleted: (pointing satellite5 star8)
   added: (pointing satellite5 star0)
   goals met: 0 of 11
2. (switch_on instrument7 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument7)
   goals met: 0 of 11
3. (calibrate satellite5 instrument7 star0)
   added: (calibrated instrument7)
   goals met: 0 of 11
4. (turn_to satellite5 phenomenon10 star0)
   deleted: (pointing satellite5 star0)
   added: (pointing satellite5 phenomenon10)
   goals met: 0 of 11
5. (turn_to satellite2 groundstation3 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 11
6. (turn_to satellite0 groundstation4 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation4)
   goals met: 0 of 11
7. (take_image satellite5 phenomenon10 instrument7 thermograph5)
   added: (have_image phenomenon10 thermograph5)
   goals met: 1 of 11
8. (take_image satellite5 phenomenon10 instrument7 spectrograph3)
   added: (have_image phenomenon10 spectrograph3)
   goals met: 2 of 11
9. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 2 of 11
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 11
11. (calibrate satellite2 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 2 of 11
12. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 2 of 11
13. (turn_to satellite0 planet7 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet7)
   goals met: 2 of 11
14. (take_image satellite0 planet7 instrument0 spectrograph4)
   added: (have_image planet7 spectrograph4)
   goals met: 3 of 11
15. (turn_to satellite2 phenomenon9 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 11
16. (take_image satellite2 phenomenon9 instrument3 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 4 of 11
17. (turn_to satellite2 star6 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star6)
   goals met: 4 of 11
18. (take_image satellite2 star6 instrument3 image2)
   added: (have_image star6 image2)
   goals met: 5 of 11
19. (turn_to satellite3 phenomenon10 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon10)
   goals met: 6 of 11
20. (turn_to satellite5 phenomenon9 phenomenon10)
   deleted: (pointing satellite5 phenomenon10)
   added: (pointing satellite5 phenomenon9)
   goals met: 6 of 11
21. (take_image satellite5 phenomenon9 instrument7 thermograph5)
   added: (have_image phenomenon9 thermograph5)
   goals met: 7 of 11
22. (turn_to satellite5 planet5 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 planet5)
   goals met: 7 of 11
23. (take_image satellite5 planet5 instrument7 thermograph5)
   added: (have_image planet5 thermograph5)
   goals met: 8 of 11
24. (turn_to satellite5 planet7 planet5)
   deleted: (pointing satellite5 planet5)
   added: (pointing satellite5 planet7)
   goals met: 8 of 11
25. (take_image satellite5 planet7 instrument7 thermograph5)
   added: (have_image planet7 thermograph5)
   goals met: 9 of 11
26. (turn_to satellite5 star6 planet7)
   deleted: (pointing satellite5 planet7)
   added: (pointing satellite5 star6)
   goals met: 9 of 11
27. (take_image satellite5 star6 instrument7 infrared1)
   added: (have_image star6 infrared1)
   goals met: 10 of 11
28. (turn_to satellite5 star8 star6)
   deleted: (pointing satellite5 star6)
   added: (pointing satellite5 star8)
   goals met: 10 of 11
29. (take_image satellite5 star8 instrument7 infrared1)
   added: (have_image star8 infrared1)
   goals met: 11 of 11
